# Bases de Datos I
## Laboratorio 9: Consultas m√°s complejas: Cl√°usulas Group By y Having. Triggers y Procedimientos Almacenados.

### Configuraci√≥n ‚öôÔ∏è

Nuevamente estaremos usando el m√≥dulo de Python `sqlalchemy`, el cual nos permitir√° ejecutar c√≥digo SQL dentro de una celda de Python.

In [1]:
import sqlalchemy
sqlalchemy.create_engine("mysql://root:1q2w3e4r@localhost:3306")
%load_ext sql
%sql mysql://root:1q2w3e4r@localhost:3306

En la celda anterior se carga la extensi√≥n de SQL y se establece conexi√≥n con el servidor, utilizando el mismo _string_ especificado en la creaci√≥n del engine. 

Ahora s√≠, realicemos un par de ejerciciosssss.

### Ejercicios üèãÔ∏è‚Äç‚ôÇÔ∏è
#### Analicemos el siguiente escenario

El aeropuerto "Jos√© Mart√≠", desea registrar los datos de las operaciones que se realizan en sus instalaciones. Para esto cuenta con un sistema automatizado que maneja la informaci√≥n, desde una base de datos relacional. De la misma se extrajo un fragmento de datos relacionados con los vuelos salientes del aeropuerto, descrito a continuaci√≥n:

**Cliente** (<u>IdCliente</u>, Nombre , Nacionalidad) 


**Vuelo** (<u>IdVuelo</u>, Destino, Duracion, IdAero)

- IdAero **FK** Aerol√≠nea. No admite nulos


**Aerol√≠nea** (<u>IdAero</u>, Nombre, FechaCreacion, Valoracion)


**Equipaje** (<u>IdEquipaje</u>, IdCliente, Peso, Tipo)

- IdCliente **FK** Cliente. No admite nulos


**VueloTomado** (<u>IdVueloTomado</u>, IdCliente, IdVuelo, IdEquipaje)

- IdCliente **FK** Cliente. No admite nulos
- IdVuelo **FK** Vuelo. No admite nulos
- IdEquipaje **FK** Equipaje. No admite nulos



Donde **Vuelo** es una salida de un avi√≥n de una aerol√≠nea a un Destino y **VueloTomado** es la representaci√≥n de un **Cliente** que toma un **Vuelo** con un determinado **Equipaje**.


##### --> Ejecute las siguientes sentencias SQL para la creaci√≥n de una base de datos `VuelosAeropuerto` que corresponda a las relaciones presentadas.

In [2]:
%%sql 

DROP DATABASE IF EXISTS VuelosAerpuerto;
CREATE DATABASE IF NOT EXISTS VuelosAerpuerto;
USE VuelosAerpuerto;

 * mysql://root:***@localhost:3306
6 rows affected.
1 rows affected.
0 rows affected.

[]

In [3]:
%%sql 

CREATE TABLE IF NOT EXISTS Cliente (
  IdCliente int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  Nombre varchar(50) NOT NULL,
  Nacionalidad varchar(50) NOT NULL,
  UNIQUE (Nombre)
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [4]:
%%sql

CREATE TABLE IF NOT EXISTS Aerol√≠nea (
    IdAero int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
    Nombre char(20) NOT NULL,
    FechaCreacion date NOT NULL,
    Valoracion float(10) unsigned
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [5]:
%%sql

CREATE TABLE IF NOT EXISTS Vuelo (
    IdVuelo int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
    Destino varchar(32) NOT NULL,
    Duracion int(10) unsigned NOT NULL,
    IdAero INT REFERENCES Aerol√≠nea(IdAero) ON DELETE CASCADE
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [6]:
%%sql

CREATE TABLE IF NOT EXISTS Equipaje (
    IdEquipaje int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
    Peso decimal(10) unsigned NOT NULL,
    Tipo char(20) NOT NULL
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [7]:
%%sql

CREATE TABLE IF NOT EXISTS VueloTomado (
    IdVueloTomado int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
    IdCliente INT REFERENCES Cliente(IdCliente) ON DELETE CASCADE,
    IdVuelo INT REFERENCES Vuelo(IdVuelo) ON DELETE CASCADE,
    IdEquipaje INT REFERENCES Equipaje(IdEquipaje) ON DELETE CASCADE,
    Valoracion float(10) unsigned
);

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [8]:
%%sql 

INSERT INTO `Cliente` (`IdCliente`, `Nombre`, `Nacionalidad`) VALUES
(1, 'Juan Perez', 'Mexicana'),
(2, 'Maria Lopez', 'Argentina'),
(3, 'Carlos Garc√≠a', 'Colombiana'),
(4, 'Ana Fern√°ndez', 'Chilena'),
(5, 'Luis Mart√≠nez', 'Peruana'),
(6, 'Sof√≠a S√°nchez', 'Mexicana'),
(7, 'Miguel Torres', 'Argentina'),
(8, 'Luc√≠a Ruiz', 'Colombiana'),
(9, 'Jos√© Ram√≠rez', 'Chilena'),
(10, 'Paula Morales', 'Peruana'),
(11, 'Pedro Gomez', 'Mexicana'),
(12, 'Laura Diaz', 'Argentina'),
(13, 'Fernando Castro', 'Colombiana'),
(14, 'Elena Vargas', 'Chilena'),
(15, 'Jorge Herrera', 'Peruana'),
(16, 'Valentina Flores', 'Mexicana'),
(17, 'Ricardo Molina', 'Argentina'),
(18, 'Gabriela Jim√©nez', 'Colombiana'),
(19, 'Andr√©s Ortiz', 'Chilena'),
(20, 'Marta Soto', 'Peruana'),
(21, 'Daniel Guzm√°n', 'Mexicana'),
(22, 'Natalia Ponce', 'Argentina'),
(23, 'Francisco Mu√±oz', 'Colombiana'),
(24, 'Carmen Silva', 'Chilena'),
(25, 'Ra√∫l Ramos', 'Peruana'),
(26, 'Cristina Le√≥n', 'Mexicana'),
(27, 'Diego Vega', 'Argentina'),
(28, 'Patricia Rivas', 'Colombiana'),
(29, 'Santiago Medina', 'Chilena'),
(30, 'Sara Herrera', 'Peruana'),
(31, 'Alejandro Delgado', 'Mexicana'),
(32, 'Rosa Ben√≠tez', 'Argentina'),
(33, 'Antonio Mendez', 'Colombiana'),
(34, 'Emma Reyes', 'Chilena'),
(35, 'Roberto Suarez', 'Peruana'),
(36, 'Isabel Pe√±a', 'Mexicana'),
(37, 'Felipe Aguilar', 'Argentina'),
(38, 'Claudia Prieto', 'Colombiana'),
(39, 'Eduardo Bravo', 'Chilena'),
(40, 'Monica N√∫√±ez', 'Peruana'),
(41, 'Manuel Cort√©s', 'Mexicana'),
(42, 'Ver√≥nica Fuentes', 'Argentina'),
(43, 'Julio Salazar', 'Colombiana'),
(44, 'Pilar Acosta', 'Chilena'),
(45, 'C√©sar Cabrera', 'Peruana'),
(46, 'Teresa Guerrero', 'Mexicana'),
(47, 'Oscar Campos', 'Argentina'),
(48, 'Adriana Espinoza', 'Colombiana'),
(49, 'Iv√°n L√≥pez', 'Chilena'),
(50, 'Alicia Ortega', 'Peruana');

 * mysql://root:***@localhost:3306
50 rows affected.

[]

In [9]:
%%sql

INSERT INTO Vuelo (IdVuelo, Destino, Duracion, IdAero) VALUES
(1, 'Ciudad de M√©xico', 270, 1),
(2, 'Buenos Aires', 180, 2),
(3, 'Bogot√°', 165, 3),
(4, 'Santiago', 240, 4),
(5, 'Lima', 200, 2),
(6, 'Ciudad de Panam√°', 300, 5),
(7, 'Caracas', 150, 3),
(8, 'Montevideo', 170, 1),
(9, 'Quito', 160, 4),
(10, 'Guayaquil', 215, 5),
(11, 'Punta Cana', 100, 4)

 * mysql://root:***@localhost:3306
11 rows affected.

[]

In [10]:
%%sql

INSERT INTO Aerol√≠nea (IdAero, Nombre, FechaCreacion, Valoracion) VALUES
(1, 'AeroMexico', '1990-03-12', 0),
(2, 'LATAM', '2001-05-25', 0),
(3, 'Avianca', '2006-12-04', 0),
(4, 'Copa Airlines', '1985-07-06', 0),
(5, 'Sky Airline', '1995-04-19', 0);

 * mysql://root:***@localhost:3306
5 rows affected.

[]

In [11]:
%%sql

SELECT * FROM VueloTomado;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [12]:
%%sql

INSERT INTO VueloTomado (IdCliente, IdVuelo, IdEquipaje) VALUES
(1, 1, 1),
(2, 2, 2),
(3, 3, 3),
(4, 4, 4),
(5, 5, 5),
(6, 6, 6),
(7, 7, 7),
(8, 8, 8),
(9, 2, 9),
(10, 10, 10),
(11, 1, 11),
(12, 3, 12),
(13, 3, 13),
(14, 4, 14),
(15, 6, 15),
(16, 6, 16),
(17, 7, 17),
(18, 5, 18),
(19, 9, 19),
(20, 10, 20),
(21, 1, 21),
(22, 2, 22),
(23, 4, 23),
(24, 4, 24),
(25, 2, 25),
(26, 6, 26),
(27, 7, 27),
(28, 8, 28),
(29, 5, 29),
(30, 10, 30),
(31, 1, 31),
(32, 2, 27),
(33, 6, 33),
(34, 6, 34),
(35, 5, 35),
(36, 6, 36),
(37, 7, 37),
(38, 7, 38),
(39, 9, 39),
(40, 10, 40),
(41, 1, 1),
(42, 8, 2),
(43, 3, 3),
(44, 8, 4),
(45, 9, 5),
(46, 6, 6),
(47, 7, 7),
(48, 8, 8),
(49, 9, 9),
(50, 10, 10),
(1, 1, 11),
(2, 9, 12),
(3, 3, 13),
(4, 4, 14),
(5, 1, 15),
(6, 6, 16),
(7, 1, 17),
(8, 8, 18),
(9, 9, 19),
(10, 10, 20),
(11, 1, 21),
(12, 2, 22),
(13, 1, 23),
(14, 4, 24),
(15, 5, 25),
(16, 6, 26),
(17, 3, 27),
(18, 8, 28),
(19, 4, 29),
(20, 10, 30),
(21, 1, 31),
(22, 2, 32),
(23, 5, 33),
(24, 4, 34),
(25, 5, 35),
(26, 6, 36),
(27, 6, 37),
(28, 8, 38),
(29, 9, 39),
(30, 10, 40),
(31, 7, 1),
(32, 2, 2),
(33, 3, 3),
(34, 4, 4),
(35, 5, 5),
(36, 6, 6),
(37, 8, 7),
(38, 8, 8),
(39, 9, 9),
(40, 2, 10),
(4, 4, 14),
(22, 11, 7),
(12, 11, 5),
(16, 11, 19),
(22, 11, 16),
(13, 11, 17),
(31, 11, 3);

 * mysql://root:***@localhost:3306
97 rows affected.

[]

In [13]:
%%sql

INSERT INTO Equipaje (IdEquipaje, Peso, Tipo) VALUES
(1, 23.5, 'Maleta'),
(2, 7.0, 'Bolsa de mano'),
(3, 25.0, 'Maleta'),
(4, 3.2, 'Bolsa de mano'),
(5, 30.0, 'Maleta'),
(6, 22.5, 'Maleta'),
(7, 6.0, 'Bolsa de mano'),
(8, 19.0, 'Maleta'),
(9, 2.5, 'Bolsa de mano'),
(10, 26.0, 'Maleta'),
(11, 20.5, 'Maleta'),
(12, 4.3, 'Bolsa de mano'),
(13, 27.0, 'Maleta'),
(14, 7.5, 'Bolsa de mano'),
(15, 28.0, 'Maleta'),
(16, 22.0, 'Maleta'),
(17, 1.8, 'Bolsa de mano'),
(18, 29.0, 'Maleta'),
(19, 3.4, 'Bolsa de mano'),
(20, 24.5, 'Maleta'),
(21, 18.0, 'Mochila'),
(22, 18.5, 'Malet√≠n'),
(23, 15.0, 'Mochila'),
(24, 19.0, 'Malet√≠n'),
(25, 22.0, 'Mochila'),
(26, 20.5, 'Malet√≠n'),
(27, 9.0, 'Mochila'),
(28, 18.0, 'Malet√≠n'),
(29, 16.0, 'Mochila'),
(30, 19.5, 'Malet√≠n'),
(31, 12.5, 'Mochila'),
(32, 21.0, 'Malet√≠n'),
(33, 19.5, 'Mochila'),
(34, 20.0, 'Malet√≠n'),
(35, 11.5, 'Mochila'),
(36, 19.0, 'Malet√≠n'),
(37, 15.5, 'Mochila'),
(38, 20.5, 'Malet√≠n'),
(39, 9.0, 'Mochila'),
(40, 18.5, 'Malet√≠n');

 * mysql://root:***@localhost:3306
40 rows affected.

[]

> **Voz en off con tono grave:**  Contando con esta informaci√≥n se puede entonces dar respuesta a los siguientes incisos utilizando el
lenguaje SQL.

a) Obtenga la informaci√≥n asociada a la cantidad de pasajeros de cada Vuelo y su destino, ordenada de mayor a menor.

In [14]:
%%sql

SELECT Vuelo.Destino, COUNT(VueloTomado.IdCliente) AS CantClientes 
FROM Vuelo 
    JOIN VueloTomado ON Vuelo.IdVuelo = VueloTomado.IdVuelo 
GROUP BY Vuelo.Destino 
ORDER BY CantClientes DESC;

 * mysql://root:***@localhost:3306
11 rows affected.

[('Ciudad de Panam√°', 13),
 ('Ciudad de M√©xico', 11),
 ('Santiago', 10),
 ('Montevideo', 10),
 ('Buenos Aires', 9),
 ('Lima', 8),
 ('Guayaquil', 8),
 ('Quito', 8),
 ('Bogot√°', 7),
 ('Caracas', 7),
 ('Punta Cana', 6)]

b) Obtenga las 3 aerol√≠neas con los vuelos de mayor duraci√≥n.

In [15]:
%%sql

SELECT Aerol√≠nea.Nombre, MAX(Vuelo.Duracion) as DuracionMaxima 
FROM Vuelo 
    JOIN Aerol√≠nea ON Vuelo.IdAero = Aerol√≠nea.IdAero 
GROUP BY Vuelo.IdAero 
ORDER BY DuracionMaxima DESC 
LIMIT 3;

 * mysql://root:***@localhost:3306
3 rows affected.

[('Sky Airline', 300), ('AeroMexico', 270), ('Copa Airlines', 240)]

c) Obtenga los clientes cuya suma de peso en sus equipajes sea mayor que 40 Kg. La informaci√≥n debe de estar ordenada descendentemente seg√∫n el peso total del equipaje.

In [16]:
%%sql

SELECT Cliente.Nombre, SUM(Equipaje.Peso) as PesoTotal 
FROM VueloTomado 
    JOIN Cliente ON VueloTomado.IdCliente = Cliente.IdCliente 
    JOIN Equipaje ON VueloTomado.IdEquipaje = Equipaje.IdEquipaje 
GROUP BY Cliente.IdCliente 
HAVING PesoTotal > 40 
ORDER BY PesoTotal DESC;

 * mysql://root:***@localhost:3306
18 rows affected.

[('Natalia Ponce', Decimal('68')),
 ('Alejandro Delgado', Decimal('62')),
 ('Luis Mart√≠nez', Decimal('58')),
 ('Laura Diaz', Decimal('53')),
 ('Carlos Garc√≠a', Decimal('52')),
 ('Paula Morales', Decimal('51')),
 ('Jorge Herrera', Decimal('50')),
 ('Luc√≠a Ruiz', Decimal('48')),
 ('Gabriela Jim√©nez', Decimal('47')),
 ('Valentina Flores', Decimal('46')),
 ('Juan Perez', Decimal('45')),
 ('Sof√≠a S√°nchez', Decimal('45')),
 ('Marta Soto', Decimal('45')),
 ('Antonio Mendez', Decimal('45')),
 ('Monica N√∫√±ez', Decimal('45')),
 ('Fernando Castro', Decimal('44')),
 ('Roberto Suarez', Decimal('42')),
 ('Isabel Pe√±a', Decimal('42'))]

d) Obtenga los clientes donde el total de su equipaje de tipo `Bolsa de Mano` cuyo peso supera los 5 Kg, o con `Mochila` de menos de 15 Kg.

In [17]:
%%sql

SELECT Cliente.Nombre, SUM(Equipaje.Peso) as PesoTotal, Equipaje.Tipo 
FROM VueloTomado 
    JOIN Cliente ON VueloTomado.IdCliente = Cliente.IdCliente 
    JOIN Equipaje ON VueloTomado.IdEquipaje = Equipaje.IdEquipaje
GROUP BY Cliente.Nombre, Equipaje.Tipo
HAVING (Equipaje.Tipo = "Bolsa de Mano" AND PesoTotal > 5)
OR (Equipaje.Tipo = "Mochila" AND PesoTotal < 15);

 * mysql://root:***@localhost:3306
15 rows affected.

[('Maria Lopez', Decimal('11'), 'Bolsa de mano'),
 ('Ana Fern√°ndez', Decimal('19'), 'Bolsa de mano'),
 ('Miguel Torres', Decimal('8'), 'Bolsa de mano'),
 ('Jos√© Ram√≠rez', Decimal('6'), 'Bolsa de mano'),
 ('Elena Vargas', Decimal('8'), 'Bolsa de mano'),
 ('Alejandro Delgado', Decimal('13'), 'Mochila'),
 ('Rosa Ben√≠tez', Decimal('9'), 'Mochila'),
 ('Roberto Suarez', Decimal('12'), 'Mochila'),
 ('Eduardo Bravo', Decimal('9'), 'Mochila'),
 ('Ver√≥nica Fuentes', Decimal('7'), 'Bolsa de mano'),
 ('Oscar Campos', Decimal('6'), 'Bolsa de mano'),
 ('Ricardo Molina', Decimal('9'), 'Mochila'),
 ('Rosa Ben√≠tez', Decimal('7'), 'Bolsa de mano'),
 ('Felipe Aguilar', Decimal('6'), 'Bolsa de mano'),
 ('Natalia Ponce', Decimal('6'), 'Bolsa de mano')]

In [18]:
%%sql

SELECT Cliente.Nombre, SUM(Equipaje.Peso) as PesoTotal, Equipaje.Tipo 
FROM VueloTomado 
    JOIN Cliente ON VueloTomado.IdCliente = Cliente.IdCliente 
    JOIN Equipaje ON VueloTomado.IdEquipaje = Equipaje.IdEquipaje 
WHERE Equipaje.Tipo = "Bolsa de Mano" 
GROUP BY Cliente.Nombre HAVING PesoTotal > 5 

UNION 

SELECT Cliente.Nombre, SUM(Equipaje.Peso) as PesoTotal, Equipaje.Tipo 
FROM VueloTomado 
    JOIN Cliente ON VueloTomado.IdCliente = Cliente.IdCliente 
    JOIN Equipaje ON VueloTomado.IdEquipaje = Equipaje.IdEquipaje 
WHERE Equipaje.Tipo = "Mochila" 
GROUP BY Cliente.Nombre 
HAVING PesoTotal < 15;

 * mysql://root:***@localhost:3306
15 rows affected.

[('Maria Lopez', Decimal('11'), 'Bolsa de mano'),
 ('Ana Fern√°ndez', Decimal('19'), 'Bolsa de mano'),
 ('Miguel Torres', Decimal('8'), 'Bolsa de mano'),
 ('Jos√© Ram√≠rez', Decimal('6'), 'Bolsa de mano'),
 ('Elena Vargas', Decimal('8'), 'Bolsa de mano'),
 ('Ver√≥nica Fuentes', Decimal('7'), 'Bolsa de mano'),
 ('Oscar Campos', Decimal('6'), 'Bolsa de mano'),
 ('Rosa Ben√≠tez', Decimal('7'), 'Bolsa de mano'),
 ('Felipe Aguilar', Decimal('6'), 'Bolsa de mano'),
 ('Natalia Ponce', Decimal('6'), 'Bolsa de mano'),
 ('Alejandro Delgado', Decimal('13'), 'Mochila'),
 ('Rosa Ben√≠tez', Decimal('9'), 'Mochila'),
 ('Roberto Suarez', Decimal('12'), 'Mochila'),
 ('Eduardo Bravo', Decimal('9'), 'Mochila'),
 ('Ricardo Molina', Decimal('9'), 'Mochila')]

e) Obtenga los clientes que hayan volado al menos 2 veces con `Copa Airlines`.

In [19]:
%%sql

SELECT Cliente.Nombre, COUNT(VueloTomado.IdVueloTomado) AS CantidadDeVuelos
FROM Cliente 
    JOIN VueloTomado ON Cliente.IdCliente = VueloTomado.IdCliente 
    JOIN Vuelo ON Vuelo.IdVuelo = VueloTomado.IdVuelo 
    JOIN Aerol√≠nea ON Vuelo.IdAero = Aerol√≠nea.IdAero
WHERE Aerol√≠nea.Nombre = "Copa Airlines"
GROUP BY Cliente.Nombre 
HAVING COUNT(VueloTomado.IdVueloTomado) >= 2;

 * mysql://root:***@localhost:3306
6 rows affected.

[('Ana Fern√°ndez', 3),
 ('Elena Vargas', 2),
 ('Andr√©s Ortiz', 2),
 ('Carmen Silva', 2),
 ('Eduardo Bravo', 2),
 ('Natalia Ponce', 2)]

f) El aeropuerto desea limitar el peso de los equipajes peque√±os, con el fin de que los clientes prioricen el uso de `Maletas` para la mayor√≠a de los objetos y as√≠ facilitar los chequeos. Construya un recurso de MySQL para limitar el peso de los nuevos Equipajes del tipo `Bolso de Mano` a 10 Kg y las `Mochilas` a 20 Kg.

In [20]:
%%sql

CREATE TRIGGER CheckWeight BEFORE INSERT 
ON Equipaje FOR EACH ROW BEGIN
    IF ((NEW.Tipo = "Bolso de Mano" AND NEW.Peso > 10.0) OR (NEW.Tipo = "Mochila" AND NEW.Peso > 20.0)) THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'El tipo de equipaje excede el peso m√°ximo.';
    END IF;
END;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [21]:
%%sql

INSERT INTO Equipaje (Peso, Tipo) VALUES 
(14.0, "Bolso de Mano");

 * mysql://root:***@localhost:3306
(MySQLdb.OperationalError) (1644, 'El tipo de equipaje excede el peso m√°ximo.')
[SQL: INSERT INTO Equipaje (Peso, Tipo) VALUES
(14.0, "Bolso de Mano");]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

g) Un Cliente puede agregar una Valoraci√≥n a una instancia de `VueloTomado`, lo que representa su satisfacci√≥n con dicho vuelo. Se desea asignar una valoraci√≥n a cada Aerol√≠nea, teniendo en cuenta la valoraci√≥n de los clientes de los vuelos que han tomado, de forma que siempre que alguien agregue una valoraci√≥n, esta se refleje en la aerol√≠nea tambi√©n.

In [22]:
%%sql

CREATE TRIGGER UpdateRatingInsert AFTER INSERT 
ON VueloTomado FOR EACH ROW BEGIN
    DECLARE idAero INT;
    DECLARE avgRanking FLOAT;

    SET idAero = (
        SELECT Vuelo.IdAero 
        FROM Vuelo 
        WHERE IdVuelo = NEW.IdVuelo
    );

    SET avgRanking = (
        SELECT AVG(VueloTomado.Valoracion) 
        FROM Vuelo 
            JOIN VueloTomado ON Vuelo.IdVuelo = VueloTomado.IdVuelo 
        WHERE Vuelo.IdAero = idAero
    );

    UPDATE Aerol√≠nea SET Valoracion = avgRanking WHERE Aerol√≠nea.IdAero = idAero;
END;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [23]:
%%sql

Show TRIGGERS;

 * mysql://root:***@localhost:3306
2 rows affected.

[('CheckWeight', 'INSERT', 'Equipaje', 'BEGIN\n    IF ((NEW.Tipo = "Bolso de Mano" AND NEW.Peso > 10.0) OR (NEW.Tipo = "Mochila" AND NEW.Peso > 20.0)) THEN\n        SIGNAL SQLSTATE \'45000\' SET MESSAGE_TEXT = \'El tipo de equipaje excede el peso m√°ximo.\';\n    END IF;\nEND', 'BEFORE', datetime.datetime(2024, 7, 16, 12, 28, 39, 190000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci'),
 ('UpdateRatingInsert', 'INSERT', 'VueloTomado', 'BEGIN\n    DECLARE idAero INT;\n    DECLARE avgRanking FLOAT;\n\n    SET idAero = (\n        SELECT Vuelo.IdAero \n        FROM Vuelo \n        WHERE ... (178 characters truncated) ... omado.IdVuelo \n        WHERE Vuelo.IdAero = idAero\n    );\n\n    UPDATE Aerol√≠nea SET Valoracion = avgRanking WHERE Aerol√≠nea.IdAero = idAero;\nEND', 'AFTER', datetime.datetime(2024, 7, 16, 12, 28, 39, 200000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'root@localhost', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

In [24]:
%%sql

INSERT INTO VueloTomado (IdCliente, IdVuelo, IdEquipaje, Valoracion) VALUES
(1, 3, 18, 3.6);
INSERT INTO VueloTomado (IdCliente, IdVuelo, IdEquipaje, Valoracion) VALUES
(1, 3, 18, 4);

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.

[]

In [25]:
%%sql

SELECT * FROM Aerol√≠nea;

 * mysql://root:***@localhost:3306
5 rows affected.

[(1, 'AeroMexico', datetime.date(1990, 3, 12), 0.0),
 (2, 'LATAM', datetime.date(2001, 5, 25), 0.0),
 (3, 'Avianca', datetime.date(2006, 12, 4), 3.8),
 (4, 'Copa Airlines', datetime.date(1985, 7, 6), 0.0),
 (5, 'Sky Airline', datetime.date(1995, 4, 19), 0.0)]

¬øQu√© pasar√° si se modifica la valoraci√≥n de un VueloTomado ya existente?

In [26]:
%%sql

CREATE TRIGGER UpdateRatingUpdate AFTER UPDATE 
ON VueloTomado FOR EACH ROW BEGIN
    DECLARE idAero INT;
    DECLARE avgRanking FLOAT;

    SET idAero = (
        SELECT Vuelo.IdAero 
        FROM Vuelo 
        WHERE IdVuelo = NEW.IdVuelo
    );

    SET avgRanking = (
        SELECT AVG(VueloTomado.Valoracion) 
        FROM Vuelo 
            JOIN VueloTomado ON Vuelo.IdVuelo = VueloTomado.IdVuelo 
        WHERE Vuelo.IdAero = idAero
    );

    UPDATE Aerol√≠nea SET Valoracion = avgRanking WHERE Aerol√≠nea.IdAero = idAero;
END;

 * mysql://root:***@localhost:3306
0 rows affected.

[]

h) Las aerol√≠neas le han pedido a la direcci√≥n del aeropuerto que desean crear una categor√≠a de _Cliente VIP_, bas√°ndose en ciertas m√©tricas, como por ejemplo: aquellos clientes que hayan viajado m√°s de 3 veces con su aerol√≠nea y que no hayan llevado equipaje del tipo `Maleta`. La direcci√≥n del aeropuerto desea que dicho requisito sea implementado sin tener que modificar la estructura de la BD existente, adem√°s que se quiere que esa actualizaci√≥n se haga solamente cuando un representante de una aerol√≠nea lo pida directamente a la direcci√≥n.

In [27]:
%%sql

DROP TABLE IF EXISTS ClienteVip;
CREATE TABLE IF NOT EXISTS ClienteVip (
    IdAero INT REFERENCES Aerol√≠nea(IdAero) ON DELETE CASCADE,
    IdCliente INT REFERENCES Cliente(IdCliente) ON DELETE CASCADE,
    PRIMARY KEY (IdAero, IdCliente)
);

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]

In [28]:
%%sql

DROP PROCEDURE IF EXISTS CalculateVips;
CREATE PROCEDURE CalculateVips (IN idAero INT)
BEGIN
    INSERT INTO ClienteVip (IdAero, IdCliente)
        SELECT IdAero, IdCliente FROM (
            SELECT Vuelo.IdAero, Cliente.IdCliente, Equipaje.IdEquipaje 
            FROM Cliente 
                JOIN VueloTomado ON Cliente.IdCliente = VueloTomado.IdCliente 
                JOIN Vuelo ON Vuelo.IdVuelo = VueloTomado.IdVuelo
                JOIN Equipaje ON Equipaje.IdEquipaje = VueloTomado.IdEquipaje 
            WHERE Vuelo.IdVuelo = idAero AND Equipaje.Tipo != "Maleta"
            GROUP BY Vuelo.IdAero, Cliente.IdCliente, Equipaje.IdEquipaje 
            HAVING COUNT(VueloTomado.IdVueloTomado) >= 2
        ) as VipFilter;
END;

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]

In [29]:
%%sql

CALL CalculateVips(4); 
SELECT * FROM ClienteVip WHERE IdAero = 4;

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.

[(4, 4)]

i) El aeropuerto desea implementar un sistema de "inyecci√≥n" de reputaci√≥n para las aerol√≠neas que operan en √©l, por lo que ha decidido que esas aerol√≠neas puedan pagar para modificar las valoraciones de los vuelos tomados por sus clientes que no hayan sido valorados hasta ese momento.

In [30]:
%%sql

DROP PROCEDURE IF EXISTS InjectRating;
CREATE PROCEDURE InjectRating (IN idAero INT, IN rating FLOAT)
BEGIN
    UPDATE VueloTomado SET Valoracion = rating WHERE IdVuelo IN (
        SELECT Vuelo.IdVuelo FROM Vuelo WHERE Vuelo.IdAero = idAero
    ) AND Valoracion IS NULL;
END;

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]

In [31]:
%%sql

CALL InjectRating(4, 5.0)

 * mysql://root:***@localhost:3306
24 rows affected.

[]

In [32]:
%%sql

SELECT Nombre, Valoracion FROM Aerol√≠nea;

 * mysql://root:***@localhost:3306
5 rows affected.

[('AeroMexico', 0.0),
 ('LATAM', 0.0),
 ('Avianca', 3.8),
 ('Copa Airlines', 5.0),
 ('Sky Airline', 0.0)]